Revit 2024 API
PipingSystem.IsFlowServerMissing Method
 Indicates if any flow server which was used in the piping system is not available.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsFlowServerMissing()
Visual Basic
Public Function IsFlowServerMissing As Boolean
Visual C++
public:
bool IsFlowServerMissing()
Return Value
 True if there is any flow server not available, false otherwise.
See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace